public class JvmComprehension {

    public static void main(String[] args) {
        // Stack: при запуске программы в стеке создаётся фрейм для метода main

        int i = 1;
        // 1
        // Stack: внутри фрейма main выделяется ячейка под примитивный тип int, в неё
        // записывается значение 1

        Object o = new Object();
        // 2
        // Объект в Heap, ссылка на него - в Stack, во фрейме main: Конструкция new
        // Object() создаёт новый
        // экземпляр класса Object в куче (Heap), а внутри фрейма main создается
        // локальная переменная o

        Integer ii = 2;
        // 3
        // Объект в Heap, ссылка на него - в Stack, во фрейме main:Происходит autoboxing
        // - поскольку 2 входит в диапазон кэша
        // целых чисел (от -128 до 127), JVM не создает новый объект, а возвращает
        // ссылку на уже
        // существующий объект Integer из IntegerCache (который инициализируется при
        // старте JVM в Heap)

        printAll(o, i, ii);
        // 4
        // Stack: поверх фрейма main создаётся новый фрейм для метода printAll, туда
        // копируются значение примитива i,
        // ссылка на объект o и ii, обе ссылки теперь ведут на те же самые объекты в
        // куче, что и переменные из метода main

        System.out.println("finished");
        // 7
        // Объект в Heap, ссылка на него - в Stack: Вызывается метод println, создается
        // фрейм в стеке, аргументом
        // передается ссылка на объект "finished" из String Pool. После вывода сообщения
        // в консоль фрейм метода
        // println уничтожается

        // После строки 7 метод main завершает свою работу, фрейм main удаляется из
        // стека
        // Стек потока становится пустым, программа завершается, а выделенная
        // оперативная память возвращается
        // операционной системе

    }

    private static void printAll(Object o, int i, Integer ii) {
        Integer uselessVar = 700;
        // 5
        // Объект в Heap, ссылка на него - в Stack, во фрейме printAll:Происходить
        // aoutoboxing - число 700 выходит за
        // рамки стандартного кэша Integer,поэтому JVM выделяет память и создает новый
        // объект Integer со значением 700 в Heap

        System.out.println(o.toString() + i + ii);
        // 6
        // 1.Вызывается метод o.toString():Создается короткоживущий фрейм для
        // toString(), который возвращает строковое
        // представление объекта, эта строка создается в куче (Heap), послее возврата
        // значения фрейм toString() уничтожается

        // 2.Происходит конкатенация строк:В процессе объединения строк в Heap создается
        // новый результирующий объект String

        // 3.Вызывается метод println:Под него создается свой фрейм в стеке, куда
        // передается ссылка на получившуюся
        // финальную строку, строка выводится в консоль, после чего фрейм println
        // удаляется

        // Сборка мусора (GC):Сразу после выполнения этой строки метод printAll
        // завершается, его фрейм полностью удаляется из стека
    }
}